; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p2-0 - location
	p3-0 - location
	p3-2 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s4)
	(at package2 s0)
	(at package3 s3)
	(at package4 s2)
	(at package5 s4)
	(at package6 s4)
	(at package7 s3)
	(at package8 s1)
	(at package9 s4)
	(at package10 s4)
	(at package11 s0)
	(at package12 s3)
	(at package13 s4)
	(at package14 s2)
	(at package15 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 62)
	(= (time-to-drive s1 s0) 62)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 29)
	(= (time-to-drive s2 s0) 29)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 96)
	(= (time-to-drive s2 s1) 96)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 19)
	(= (time-to-drive s3 s2) 19)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 30)
	(= (time-to-drive s4 s2) 30)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 52)
	(= (time-to-drive s0 s3) 52)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 74)
	(= (time-to-drive s4 s3) 74)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 94)
	(= (time-to-drive s0 s4) 94)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s1)
	(at truck2 s0)
	(at truck3 s0)
	(at package1 s4)
	(at package2 s4)
	(at package3 s4)
	(at package4 s1)
	(at package5 s0)
	(at package6 s4)
	(at package7 s3)
	(at package8 s2)
	(at package9 s1)
	(at package10 s3)
	(at package11 s2)
	(at package12 s3)
	(at package13 s1)
	(at package14 s4)
	(at package15 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 4 of 21
2. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 21
3. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 4 of 21
4. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 5 of 21
5. (drive-truck truck1 s3 s2 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 209
   goals met: 5 of 21
6. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 21
7. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 21
8. (load-truck package5 truck2 s4)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 21
9. (load-truck package9 truck2 s4)
   deleted: (at package9 s4)
   added: (in package9 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 21
10. (load-truck package13 truck2 s4)
   deleted: (at package13 s4)
   added: (in package13 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 5 of 21
11. (load-truck package14 truck1 s2)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 5 of 21
12. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 209 to 1745
   goals met: 6 of 21
13. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 7 of 21
14. (load-truck package8 truck1 s1)
   deleted: (at package8 s1)
   added: (in package8 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 7 of 21
15. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 1745 to 3281
   goals met: 6 of 21
16. (unload-truck package8 truck1 s2)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 7 of 21
17. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 3281 to 4529
   goals met: 8 of 21
18. (load-truck package10 truck2 s4)
   deleted: (at package10 s4)
   added: (in package10 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 8 of 21
19. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 4529 to 6009
   goals met: 8 of 21
20. (unload-truck package10 truck2 s3)
   deleted: (in package10 truck2)
   added: (at package10 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 21
21. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   goals met: 8 of 21
22. (drive-truck truck1 s1 s2 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 6009 to 7257
   goals met: 7 of 21
23. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 7257 to 8089
   goals met: 8 of 21
24. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 9 of 21
25. (load-truck package2 truck2 s0)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 9 of 21
26. (load-truck package11 truck2 s0)
   deleted: (at package11 s0)
   added: (in package11 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 9 of 21
27. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   goals met: 10 of 21
28. (load-truck package15 truck2 s0)
   deleted: (at package15 s0)
   added: (in package15 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 10 of 21
29. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 8089 to 10439
   goals met: 9 of 21
30. (drive-truck truck1 s2 s1 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 10439 to 11687
   goals met: 10 of 21
31. (unload-truck package2 truck2 s4)
   deleted: (in package2 truck2)
   added: (at package2 s4)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 11 of 21
32. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 11687 to 13167
   goals met: 11 of 21
33. (unload-truck package15 truck2 s3)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 12 of 21
34. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 13167 to 13471
   goals met: 12 of 21
35. (unload-truck package11 truck2 s2)
   deleted: (in package11 truck2)
   added: (at package11 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 13 of 21
36. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 13471 to 13718
   goals met: 13 of 21
37. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   goals met: 12 of 21
38. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   goals met: 12 of 21
39. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 13718 to 14394
   goals met: 13 of 21
40. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 13 of 21
41. (drive-truck truck3 s4 s0 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 14394 to 15334
   goals met: 14 of 21
42. (drive-truck truck1 s1 s0 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 15334 to 16140
   goals met: 13 of 21
43. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 14 of 21
44. (drive-truck truck1 s0 s4 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 16140 to 17362
   goals met: 14 of 21
45. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 15 of 21
46. (unload-truck package14 truck1 s4)
   deleted: (in package14 truck1)
   added: (at package14 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 16 of 21
47. (drive-truck truck1 s4 s0 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 17362 to 18302
   goals met: 16 of 21
48. (disembark-truck driver4 truck1 s0)
   deleted: (driving driver4 truck1)
   added: (at driver4 s0) (empty truck1)
   goals met: 16 of 21
49. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 16 of 21
50. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 18302 to 19108
   goals met: 15 of 21
51. (unload-truck package9 truck2 s1)
   deleted: (in package9 truck2)
   added: (at package9 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 16 of 21
52. (unload-truck package13 truck2 s1)
   deleted: (in package13 truck2)
   added: (at package13 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 17 of 21
53. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 19108 to 19728
   goals met: 18 of 21
54. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 18 of 21
55. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 19 of 21
56. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 18 of 21
57. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 19728 to 20348
   goals met: 19 of 21
58. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 19 of 21
59. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 19 of 21
60. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 19 of 21
61. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 20348 to 20968
   goals met: 18 of 21
62. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 18 of 21
63. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 18 of 21
64. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 20968 to 21588
   goals met: 19 of 21
65. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 20 of 21
66. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   goals met: 20 of 21
67. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   goals met: 21 of 21
